[
    {
        "url": "https://docs.flexsim.com/en/25.2/FlexSimUI/OverviewUserInterface/OverviewUserInterface.html",
        "title": "Overview of the FlexSim User Interface",
        "content": "Introduction This topic will provide a high-level overview of the most important elements of the FlexSim user interface and will explain some of its key terms and concepts. You will primarily build your simulation model using two interfaces: the 3D model and the Process Flow tool. The 3D model is where you will visualize your business system using 3D graphics. The Process Flow tool is where you will build the logic that powers your 3D model. The most important elements of the 3D model interface are labeled in the following image: The Process Flow interface closely resembles the 3D model interface. The most important elements of the Process Flow tool are labeled in the following image: This topic will focus on explaining the elements of the 3D model interface. To learn more about the Process Flow interface, see Overview of the Process Flow Interface . 3D Model (Center Pane) Located in the center pane, the 3D model is the main workspace you will use to create a 3D simulation model of your business system. You can drag objects from the Library into the model to begin creating your simulation. When you run a simulation, the objects in your simulation model will begin to move and interact based on the logic you've defined in your simulation model. Objects (Fixed Resources, Task Executers, Flow Items) Objects are the basic building blocks of a 3D simulation model. Different types of objects have different purposes and functions within the simulation model. Some of the most common objects are: Flow items - Objects that move (or \"flow\") through the simulation model, usually from one station (typically a fixed resource) to another downstream station. Flow items can represent products, customers, paperwork, parts, or any other item that moves to various stations in your business system. By default, flow items look like boxes, but you can change the flow items to look like people (customers) or other shapes. Fixed resources - Objects that remain stationary in the 3D model. Each fixed resource performs a specific function. For example, a source creates flow items at specific intervals and introduces them to the model. A queue stores flow items until they are needed downstream. A sink removes flow items from the model, and so forth. Task executers - Objects that can move around in the 3D model and perform tasks such as transporting flow items, operating machines, etc. The most common type of task executer is the operator , which can represent an employee in the simulation model. There are many types of objects besides the main ones mentioned here. See Types of 3D Objects for a more thorough explanation. Library and Toolbox (Left Pane) Located in the left pane, the Library contains a variety of objects that you can use to build your 3D simulation model. Each type of object has specific settings (properties) that you can customize. (See Overview of 3D Library Objects for more information about these objects and their properties.) Sometimes the Library will display different objects based on the tool that is open and active in the center pane at the time. For example, when the Process Flow tool is open, the Library will display a set of objects (activities) that are unique to Process Flow. The Library also shares the left pane with the Toolbox, which is where you will manage the tools you want to use in your simulation model (such as Process Flow, Dashboards, Global Tables, etc.). See Using the Toolbox for more information. Properties (Right Pane) Located in the right pane, Properties allows you to edit the properties for any object that is currently selected in the model or in a given tool. You can also use the Properties pane to view important information (such as statistics) about objects when they are selected during a simulation run. See Using the Properties Pane for more information. Tabs When you open some of the tools in FlexSim, they might split or share the center pane with the simulation model. These tools each have their own tab in the center pane. You can click the tabs to make them active if needed. You can also control how FlexSim displays these tools or how they split the center pane. See Arranging Windows and Tabs for more information. Ports and Port Connections Objects in the simulation model need to be connected in some way in order to interact during a simulation model. One of the ways in which objects can be connected is through ports. There are two types of ports in FlexSim: Input/Output ports - These ports determine how and when a flow item passes from one fixed resource to another. When an output port on one fixed resource is connected to the input port of another object downstream, the flow item will pass from the first object's output port to the next object's input port (unless that port is closed). Center ports - When the center ports of two objects are connected, it creates a reference point between those two objects. Center ports allow objects to communicate or interact. Center ports most typically connect a fixed resource to a task executer. Alternative Ways to Connect Objects It is also possible to connect objects in FlexSim using a tool called Lists. Or you could possibly control the connections between your objects by using the Process Flow tool to build custom model logic. See Overview of 3D Object Flows for an explanation of the advantages of the different methods of connecting objects. Also see Building the Model's Logic for more information about the Process Flow tool and key concepts related to creating a model's logic. Main Menu, Toolbar, Simulation Control Bar As in most software programs, the main menu contains all of the tools and commands you might use while building your simulation model. The toolbar gives quick access to many of the commonly used tools and commands in FlexSim. The simulation control bar (also sometimes called the control bar for short) contains the tools and commands you will need to run your simulation. See Running Simulations for more information about how to use the simulation control bar. Environments Located in the top right corner, the Environments button lists available environments. Environments customize the look and feel of the program to better serve the needs of different kinds of users. For example, the Healthcare environment customizes the toolbar and reorders the library so that healthcare related tools and objects are more prominently displayed."
    },
    {
        "url": "https://docs.flexsim.com/en/25.2/FlexSimUI/CreatingNewModel/CreatingNewModel.html",
        "title": "Creating a New Simulation Model",
        "content": "You can create a new model two different ways in FlexSim: When you first open FlexSim, you see the start screen. You can start a new model by clicking New Model on the left menu. On the toolbar, click the New button to start a new model. Using either method will open the Model Units dialog box where you can specify the measurement units for your model, as shown in the following image: See the following section, About Model Units , for more information about the different model units. If you always want to use the default measurements when creating a new model in FlexSim, you can clear the Show this window for each new model check box at the bottom of the Model Units dialog box. Changing the Default Units of Measurement You should be aware of a few important things when changing the default units of measurements: The units of measurement that you set when you first create a new model cannot be changed later. So take precautions to ensure that you have specified the appropriate units when you first create your model. When you change the units of measurement to something other than the default, it will affect how statistics are reported for that simulation model. Changing the length units will also automatically scale the objects in the Library to the specified length. After selecting the appropriate measurement units for your model, click the OK button to create your new simulation model. About Model Units Behind the scenes, the FlexSim engine actually only uses one standard set of model units to measure time, distance, speed, etc. It will then convert those units into whatever units of measurement you specify when you create your model. For example, FlexSim will measure time as generic time units and then convert those time units to seconds, minutes, or hours, etc. based on what time measurement units you specify when you create the model. Likewise, it will measure distance in generic distance units and convert that to meters, feet, kilometers, etc. With that in mind, the following table will explain the different properties that are available in the Model Units dialog box: Units Description Options Default Time How time is measured while the simulation model is running. Microseconds Milliseconds Seconds Minutes Hours Days Years Seconds Length How length and distance are measured within the simulation model. Millimeters Meters Kilometers Inches Feet Yards Miles Meters Fluid How fluids are measured in the model (if applicable) Milliliters Liters Cubic Meters Fluid Ounces US Gallons US Fluid Barrels Petroleum Barrels Grams Kilograms Tonnes Ounces Pounds Short Tons Long Tons Liters Start Time The specific time of day it will be when the simulation model starts running. To modify the start time, click the hour, minute, or seconds field and either type in the new time or use the arrow keys to increase or decrease the time. Can be manually changed to any time 8:00 a.m. Start Date The specific date it will be when the simulation model starts running. You can modify the start date using two methods: Click the date and type a new date Click the calendar icon or arrow next to the date to open the calendar tool and select a new date Can be manually changed to any date Current date"
    },
    {
        "url": "https://docs.flexsim.com/en/25.2/FlexSimUI/UsingToolbox/UsingToolbox.html",
        "title": "Using the Toolbox",
        "content": "Introduction to the Toolbox The Toolbox is the place you can go to access nearly every tool in FlexSim. (See Overview of Tools for a brief description of all the tools that are available in the Toolbox.) Where is the Toolbox? The Toolbox shares the left pane with the Library. To open the Toolbox, click the Toolbox tab in the left pane or click the Tools button on the main toolbar. The Toolbox provides a single place where you can see all of the tools and tool components you are using in your simulation model. You can also use the toolbox to manage tool components. (See What Are Tool Components? for more information.) You'll want to get comfortable with how the Toolbox works because you'll use it to work on many different tasks as you're building your simulation model. Overview of Tools The following table describes the some of the major tools that are available in the Toolbox, listed in the order they appear in the Tool menu: Tool Description Global Table Internal spreadsheets where you can import and store information that can be dynamically referenced by other tools in FlexSim. See Global Tables for more information. Time Table Schedules state changes (such as scheduled down times) for specific 3D objects in the model. See Time Tables for more information. MTBF MTTR Sets random breakdown and recovery times for groups of 3D objects in the model. See MTBF MTTR for more information. Dashboard Displays data from a simulation run in real time. See Key Concepts About Dashboards and Charts for more information. Process Flow Builds the overall logic of your model. See Overview of the Process Flow Interface for more information. Global List Used when you need to create more complex flows between 3D objects. Lists can also be used for connectionless routing, filtering flow items, task management, and prioritizing fixed resources. See Key Concepts About Lists for more information. Statistics Collector Used to get standard or custom statistics from a simulation model. See Using the Statistics Collector for more information. Flow Item Bin Customizes the visual appearance of flow items in your simulation model. See Using the Flow Item Bin for more information. What Are Tool Components? This User Manual will use the term tool components in a general sense to describe a basic entity used by a specific tool. For example, you could use the Process Flow tool to create your model's logic. Using the Process Flow tool, you can make many different process flows that each contain their own pieces of model logic. Each individual process flow would be a tool component of the Process Flow tool. The Dashboard tool is another example. You can use the Dashboard tool to display charts and statistics while your simulation model is running. You can create more than one dashboard to display these statistics. Each individual dashboard would be a tool component of the Dashboard tool. The following image shows an example of both the Process Flow tool and Dashboard tool with many different tool components in the Toolbox: The other sections in this topic will discuss how to manage tool components in the Toolbox. Adding a New Tool Component You will use a slightly different method to add a new tool component depending on whether you have added that particular kind of tool component to your simulation model before now. To add the first new tool component: With the Toolbox open, click the Add button at the top of the Toolbox. This will open a menu of available tools. Select the name of the tool for which you want to add a new tool component. For example, if you want to add a new process flow, you would select Process Flow from the menu. If you wanted to add a new dashboard, you would select Dashboard from the menu, and so forth. This will create a new component. The newly created component will automatically open up in the applicable tool. See Arranging Windows and Tabs for an explanation of how you can change the display options for this tool window. Using the Toolbar If a tool has a shortcut button in the toolbar, you can alternatively add a new component directly from the toolbar. If you click on the toolbar button, a menu will open displaying the components that have been created for that tool so far. At the bottom of the menu, it will give you the option to add a new component. For example, if you click on the Dashboards button on the toolbar, a menu will open with the option to Add a dashboard at the bottom. To add additional tool components in the Toolbox: If needed, click the Plus sign next to the applicable tool name to expand and display the list of tool components that have been created so far. Right-click the tool name. Select Add [Tool Component] from the menu. For example, if you want to add a new patient track, you would right-click Dashboard and select Add Dashboard from the menu. The newly created component will immediately open up in the applicable tool. Default Component Names By default, the newly created component will be named something like ProcessFlow or Dashboard . Additional components will usually have a number like ProcessFlow1, ProcessFlow2, etc. See Renaming a Tool Component for information about changing a tool component's name. Opening and Closing a Tool Component If the tool component you want to open is not already open, you can open it using the Toolbox. (See What Are Tool Components? for a deeper explanation of what a tool component is.) To open a tool component: If needed, click the Plus sign next to the applicable tool name to expand and display the list of tool components that have been created so far. Double-click the tool component you want to open from the list. The applicable tool will open with the specific tool component you just selected. Opening Multiple Tool Components Be aware that when you open a tool component in a tool, you are only opening up the specific tool component you selected. If you've created more than one tool component, you will need to open up each one individually. For example, if you've created two global tables, you would would have to double-click both tables in the Toolbox to open them. Each component will show up as a separate tab in the tool. (See Arranging Windows and Tabs for an explanation of how you can change the display options for this tool window.) To close a tool component, click the X on the top right corner of the tool. Renaming a Tool Component To rename a tool component: If needed, click the Plus sign next to the applicable tool name to expand and display the list of tool components that have been created so far. Right-click the tool component you want to rename. Select Rename from the menu. Type the new name of the tool component and press Enter. The tool component should now have a different name. Valid Names Component names need to start with a letter or space. The name should also not include either forward or backward slashes ( \\ or / ), quotation marks (\"), the plus sign (=), dollar sign ($), or the greater-than symbol (>) Copying a Tool Component It might be useful to copy a tool component if you want to create two very similar components with subtle differences. For example, if you want two process flows to start with the same five activities, you could create a copy of the first process flow and use the copy to create the second process flow to save time. To create a copy of a tool component: If needed, click the Plus sign next to the applicable tool name to expand and display the list of tool components that have been created so far. Right-click the tool component you want to copy. Select Duplicate from the menu. By default, the new component will use the name of the component you originally copied, but it will have a _2 at the end of its name, such as ProcessFlow_2 . See Renaming a Tool Component for information on how to change the component's name. Reorganizing Tool Components If you want to change the order that components are displayed in the Toolbox : If needed, click the Plus sign next to the applicable tool name to expand and display the list of tool components that have been created so far. Right-click on the component you want to re-organize and, select one of the options depending on how you want to move the selected component: Move Up - Moves the selected component up one position in the list. Move Down - Moves the selected component down one position in the list. Move to Top - Moves the selected component to the first position in the list. Move to Bottom - Moves the selected component to the last position in the list. Organizing Tool Components Be aware that if you right-click on a tool's top folder, you can add sub-folders. You can also rearrange components within a tool by just dragging them around. Deleting a Tool Component If you want to delete a tool component: If needed, click the Plus sign next to the applicable tool name to expand and display the list of tool components that have been created so far. Right-click on the tool component you want to delete and select Delete from the menu."
    },
    {
        "url": "https://docs.flexsim.com/en/25.2/FlexSimUI/UsingProperties/UsingProperties.html",
        "title": "Using the Properties Pane",
        "content": "Introduction to the Properties Pane The Properties pane allows you to edit the properties for any object that is currently selected in the model or in a given tool. You can also use the Properties pane to view important information (such as statistics) about objects when they are selected during a simulation run. The Properties pane is context sensitive. The pane shows properties corresponding to the active tab you are working in (3D, Tree, Table, etc.) as well which object or node you have clicked on in that tab. For example, if the User Manual is the active tab, the right pane displays the table of contents for the User Manual. Getting to Properties Generally the Properties pane is docked on the right side of FlexSim's standard user interface . To edit an object's properties, just click on it, and you will see its properties in the pane on the right. Alternatively, you can double-click on an object to view its properties. This will open a properties pane next to the cursor, where you can edit the object's properties. Editing a Property A typical property in FlexSim will usually have similar components. The following image labels these components for two different properties on a processor: The following sections explain each component of the property. Property Name The name of the property tells you the purpose of the property. For example, in the preceding image, these two properties are named Setup Time and Process Time . These names describe their function. The setup time will affect how much time the 3D object needs (if any) before it can process another flow item. The process time controls how long the 3D object will process an item. Unclear About What a Property Does? Most of the time, the property name will be clear and easy to understand intuitively. However, if you're unclear about what a particular property does based on its name alone, you can look up the reference topic for that type of 3D object and read more about that specific property. Text Box The text box displays the property's current setting or value. If you know which values are valid for this property, you can type it in directly in the text box. Different properties will have a variety of possible settings or values. Some properties will allow you to use a fixed number. Some might allow you to use a statistical distribution to randomly calculate a number. Some might allow you to reference another 3D object in the model or an activity/shared asset in a process flow. Some might allow you to reference a value in a label or a global table. Notice that in the preceding image, the text boxes for the setup time and process time display very different values. The setup time is set to 5 , which means it will take 5 simulation seconds to set up the 3D object before it processes a flow item. By contrast, the process time is set to triangular(5.0, 15.0, 10.0, 0) . This means the process time is using the triangular statistical distribution to randomly assign a process time between 5 and 15 simulation seconds. See Using the Distribution Chooser for more information about random statistical distributions. Unclear About the Valid Settings for a Property? The menu options for this property will give you suggestions and guide you through the process of filling out a property for the first time (see the next section for more information). However, if you're still stuck, you can look up the reference topic for that type of 3D object and read more about that specific property. Menu Options Next to each property, you'll usually find a black arrow . When you click this arrow, it opens a menu of the available options for this property. These menu options provide you with one of the best tools to learn about that property's available settings. When you select an option, the text box will either: Automatically fill itself in with the correct syntax based on your selection, OR Another dialog box will open to guide you through selecting more options. In this way, the menu options can help teach you what options are available for a property, give you additional dialog boxes to guide you through the process, and it can help you learn the correct syntax for a property if you want to type it by hand later. For example, if you wanted to use a random statistical distribution for the process time (as shown in the preceding image), you would select Statistical Distribution from the menu and then select the type of distribution you wanted. Based on your selection, a distribution chooser dialog box would appear to guide you through selecting the restrictions for your distribution: Sampler Button Many properties have a Sampler button next to them. The sampler is a convenient shortcut tool that allows you to sample a variety of 3D objects, process flow activities/shared assets, global tables, etc. For example, if you were editing the Use Transport property on a processor, you could use the sampler to select which operator should transport flow items from the processor. What If I Sample the Wrong Kind of Object? The sampler will only allow you to sample valid objects for that particular type of property. For instance, if you're trying to specify the process time, the sampler will only give you options that return numerical values, such as labels or global tables. If you accidentally sampled the wrong object, you can click the Sample button and sample the correct object the second time. Edit Properties Button The Edit Properties button only appears if you have used the menu to make a selection that had a dialog box. The Edit Properties button will re-open the dialog box so that you can make changes. For example, if you used the menu to select a statistical distribution, you used the distribution chooser dialog box to set the initial restrictions for the distribution. If you wanted to make changes to the restrictions, you could click the Edit Properties button to open the distribution chooser and make the necessary changes. Edit Code Button If you are comfortable with FlexScript, you could click the Edit Code button to open a code editor and write custom code for this property. The Edit Code button is also useful if you are trying to learn FlexScript and you would like to see the coding logic that is used for a particular property. For example, if you were to click the Edit Code button and view the FlexScript for the process time property used in the previous example, the code for the triangular statistical distribution would look like this: Object current = ownerobject(c); Object item = param(1); /***popup:StatisticalDistribution*/ return /***tag:distribution*//**/triangular/**//**/(/**/ /***tag:par1*//**/5.0/**/ /***tag:par2*//**/, 15.0/**/ /***tag:par3*//**/, 10.0/**/ /***tag:par4*//**/, 0/**/ /***tag:par5*//**//**/ /**/)/**/ ; Editing Multiple Objects You can also edit the properties of multiple objects using the Properties pane. If you have clicked on an object that is selected (there is a red box around the object), and you change one of that object's properties, that property on all other selected objects of the same type will also be changed to the value you define. When this happens, a small hint text will appear telling you how many objects have changed. While the Properties pane allows simple changing of multiple objects' properties, you can use Property Tables to have more sophisticated visibility and control of your objects' properties."
    },
    {
        "url": "https://docs.flexsim.com/en/25.2/FlexSimUI/RunningSimulations/RunningSimulations.html",
        "title": "Running Simulations",
        "content": "What Happens When You Run a Simulation? The following sections will describe what happens in various components of your simulation model during a simulation run. 3D Simulation Model Some 3D simulation models can be quite complex. However, at their most basic level, this is what happens in a 3D model during a simulation run: Flow items get introduced into the 3D model. Typically, flow items get introduced to the model using a source object, which creates flow items and sends them to the next downstream fixed resource(s). However, it is possible to have process flows create flow items and introduce them into the 3D model as well. Flow items begin to interact with the 3D objects in the model. Generally speaking, flow items move from one fixed resource to the next downstream fixed resource. If they've been added to the simulation model, task executers (such as operators) interact with the flow items and fixed resources. Task executers might transport flow items or help fixed resources process items. When a flow item is complete, it usually leaves the simulation model using a sink object, which removes flow items from the model. However, it might end by being packed onto a rack for storage. Process Flow During a simulation run, process flows follow this basic procedure: Most process flows begin with a token creation activity that creates one or more tokens. Tokens typically look like green dots on an activity: These activities can create new tokens at regular intervals or on a schedule as soon as a simulation run begins. They can also listen for events in a simulation model and create tokens whenever a specific event occurs. NOTE: If the process flow is a sub flow, it will usually begin with a Start activity. The token creation activity will then release the token to the next downstream activity. When that activity finishes performing its action on the token, it will release it to the next downstream activity and so forth. If a Delay activity needs to hold a token for a certain amount of time, the token will change color as time elapses, which is similar visually to a fill line increasing over time: When the time has elapsed, the Delay activity will release the token to the next downstream activity. Some process flow activities will hold tokens while waiting for a certain amount of time to elapse or while waiting for another event in the process flow or simulation model. If an activity is holding many tokens at a time, the tokens might appear to stack visually. If a large quantity of tokens builds up on a process flow activity, they will be replaced by a single token that merely indicates the number of tokens inside of it, as shown in the following animated image: Process Flows typically end with a Sink activity (or a Finish activity if it is a sub flow). However, it is possible for activities to loop indefinitely without crashing the software. Why Run a Simulation? Your reasons for running a simulation will probably depend on what phase of the model-building process you are currently in. When you're in the middle of building your model's logic, you'll run your model to test that it is functioning the way you intended it to run. Running your model can help troubleshoot a lot of potential problems. After your model is functioning properly, you might want to verify your model, which means comparing your model with how your business system operates in reality to ensure accuracy. Once your model is functioning correctly and has been verified, you can run your simulation model in order to: Get data from your model. Gather data about your business system and display that information in charts, graphs, and tables. Find the optimal business system. Run an experiment to determine what happens in your business system when you change certain variables. Sell your model. Show your model in action to get approval from stakeholders on a proposed system. A Few Important Considerations Be aware that: Simulations can run indefinitely. When a simulation reaches its end time, it's more helpful to think of the simulation as being paused rather than stopped. If you press the Run button on the control bar again, the simulation will continue running indefinitely as long as there are more events to process. Simulations will run exactly the same every time, even if it has random events. If you don't change anything in a simulation model, each simulation run will be identical, even if you have set different properties to be random. Random variables will use the same random number streams each time so that you can replicate a simulation and compare what happens when you change a variable in your simulation model. Overview of the Simulation Control Bar To run a simulation, you'll use the simulation control bar (also called the control bar for short), located underneath the main menu and toolbar. The control bar contains most of the tools that you will need to run your simulation. The control bar essentially has three different groups of tools you can use to control how your simulation runs, as illustrated in the following image: See Simulation Control Bar in the reference section of the manual for a more detailed description of the toolbar buttons and options. Run Control Buttons The Run Control buttons are the basic tools you will use to start and stop your simulation, as shown in the following image: Run Time Tools The Run Time tools display how much time has elapsed during the simulation so far. It also controls how time is displayed and when the simulation stops: Run Speed Tools The Run Speed tools control how fast or slow the simulation runs. Starting a Simulation Run When you're ready to begin the simulation: You should always press the Reset button to refresh your simulation model and reset it to its starting position. Press the Run button to begin the simulation. The simulation clock will start running and the 3D model and/or process flow will start to run. See What Happens When You Run a Simulation? for more information. Skipping Forward in a Simulation Unfortunately, FlexSim does not have the ability to scrub the timeline or jump to a specific time in the simulation. But there are a few different ways you can you can skip forward in a simulation, as described in this section. The Step Button Pressing the Step button will step to the next event in the simulation. I Pressed the Step Button and Nothing Happened! Sometimes the next event may not be something that is immediately visible or apparent because it could be happening logically but not visually. For example, perhaps the next event was that a 3D object was going to fire a particular trigger, such as the OnProcessFinish trigger on a processor. When a processor finishes processing a flow item, it will fire the OnProcessFinish trigger. You might not see something visually in the model when this happens, but the Step button might move forward to this moment in time because it was the next event. In this case, you could use the Skip button to step over all the events at the same time. Be aware you can also open the Event List, which is a tool that shows all the events that occur in the simulation model. The Skip Button Pressing the Skip button will step to the next event in the simulation and run all events at that same time. Increasing the Speed of the Simulation Another solution to skipping forward is to increase the speed at which the simulation runs so that it gets to the point you are interested in faster. You can also set the simulation to stop at the moment in time you are interested in. The Fast Forward Button The Fast Forward button is an easy way to run at maximum speed. When the button is pressed, the run speed is set to maximum and the program stops updating most views. Once the next model stop time is reached or the run is manually stopped, the previous run speed is restored and the program resumes updating views. Stopping or Pausing a Simulation There are two ways you can stop a simulation. One way is to manually stop the run by pressing the Stop button on the toolbar or using the keyboard shortcut (Ctrl + Spacebar). Another way is to set a model stop time which will cause the simulation to stop at a specific time during a simulation run: Click the arrow next to the simulation clock to open the run time tools. Check the first Stop Time checkbox and enter the time you want the simulation model to stop. You can add as many stop times as you wish. Simulations Can Continue Running After the Stop Time When a simulation reaches its end time, it's more helpful to think of the simulation as being paused rather than stopped. If you press the Run button on the control bar again, the simulation will continue running indefinitely as long as there are more events to process. You can also check the Warmup Time checkbox and enter the time you want the warmup to end. What is a Warmup Time? A warmup time is the amount of time it will take the model to reach a steady state or to get to its normal operating capacity. After the model warmup time, the simulation model will reset the statistics it's collecting because they could skew the data, resulting in inaccurate information. You'll only need to use a warmup time if you are simulating a business system that requires some time to reach a steady state or its normal state of operations. For example, you'd need a warm-up time if you were simulating a hospital. Since hospitals run 24 hours a day and 7 days a week, your model would have to run for a period of time until it reached its normal operating capacity. You wouldn't want to begin collecting statistical data until it reached that point. Changing the Speed of a Simulation Run The Run Speed tools allow you to change how fast the simulation runs, as shown in the following image: The simulation speedometer shows the current speed at which the simulation is running. By default, simulations will run at a rate of 4 simulation seconds per real-time second. You can make that number faster or slower depending on how quickly you want to run the simulation. You can use the slider button to manually adjust the run speed. Alternatively, you can click on the drop-down to open the speed options . You can select one of these options to change the Run Speed: 1.00 will run the model at a speed of one model unit per real second. Maximum is the fastest speed. Custom allows you to type the speed you would like in the box directly below it. Click the Set button to apply the new custom speed settings. You can also change the Display Mode of the simulation speedometer so that it is defined as a ratio of some other unit per real second. This can be useful if you have different model events that take place over different time spans. In order to run your model in real time you can set the Display Mode to Simulation Seconds per Real Second and then set the run speed to 1. You Can Change Speeds During a Simulation Run You can adjust the speed at any time during a simulation run if needed, so feel free to experiment. Alternate Ways to Run a Simulation You can also run simulations using the Experimenter tool. See the Experimenter topic for more information."
    },
    {
        "url": "https://docs.flexsim.com/en/25.2/FlexSimUI/ChangingModelView/ChangingModelView.html",
        "title": "Changing the Model View",
        "content": "Introduction to Changing the Model View Located in the center pane, the model is the main workspace you will use to create a 3D simulation model of your business system. This topic will explain some of the basic methods for changing the camera angle that you can use to view a model. Resetting the View You can reset the view to the default view point by right-clicking on an empty space in the model to open a menu. Point to View then Reset View to return to the default perspective. Moving (Panning) in the Model To move from left to right or forward and back in the model, click somewhere inside the model and, while holding down the mouse button, drag the mouse either to the left or right side of the screen or up and down the screen. Other Ways to Pan There are two alternate methods for panning: Hold the mouse wheel and drag the mouse in the direction you want to pan. While pressing the Alt key, left-click and drag the mouse button in the direction you want to pan. These alternate methods are guaranteed to always pan in the model, whereas the standard method also may select and move objects in the model. Consider using one of the alternate methods to pan if you have a lot of objects in your model and you don't want to accidentally click and move one of them. Rotating the Model To rotate the model in any direction, right-click somewhere in the model. Then move the mouse left or right to rotate the model horizontally, or move the mouse up or down to rotate the model vertically. Other Ways to Rotate In newer versions of FlexSim, you can rotate the model by holding down the you can Alt key while you right-click. Use this method if you don't want to accidentally click on an object. Zooming In and Out the Model To zoom in and out of the model, use the wheel button on your mouse. Scrolling up will zoom in on the model and scrolling down will zoom out. Other Ways to Zoom Alternatively, you can zoom in and out of the model by holding down both the left and right mouse buttons and moving the mouse up and down. This alternate method is more precise than the standard method. Navigating in the Process Flow Tool Navigating in a process flow is very similar to navigating inside model view. You can zoom in and out and also pan left and right or up and down as needed. However, since process flows only display in 2D, you won't be able to rotate the view. There are two ways to pan left, right, up, or down: Using the mouse, click and drag on any white space in the process flow view. Hold the Ctrl key while scrolling to pan up and down. Hold the Shift key while scrolling to pan left and right. There are two ways to zoom in and out: Zoom in and out using the scroll wheel. Using the mouse, click and drag using both the left and right mouse buttons."
    },
    {
        "url": "https://docs.flexsim.com/en/25.2/FlexSimUI/ArrangingWindowsTabs/ArrangingWindowsTabs.html",
        "title": "Arranging Windows and Tabs",
        "content": "Resizing Windows and Panes You can change the default size of various windows or panes in FlexSim. For example, while you have the User Manual open, the Quick Properties pane (right pane) changes to show the Table of Contents. You could resize this pane if you want to make the Table of Contents a little bit larger so that the topic titles fit on one line. To resize a window or pane: Position your mouse over the edge of a window or pane until it changes from a mouse pointer to a set of arrows, as shown in the following image: Click on the edge of the window or pane and drag it until the window or pane is the preferred size. Rearranging Windows and Tabs If needed, you can change the way that FlexSim displays windows and tabs in the center pane. See Window and Tab Display Options for images with examples of each of the different window and tab arrangements. To re-arrange the way windows or tabs are displayed or docked: Click on the tab for the process flow you want to move and begin dragging it to another part of the screen. Before you release the mouse button, you'll notice that the window becomes undocked and floats as an independent window outside of the main FlexSim window. If you release your mouse button at this point, the window will continue to be undocked as a separate window. Also as you click on the tab or the window's title bar and drag it around the screen, notice that a Guide Diamond appears near the center of the main FlexSim window, as shown in the following image: While still pressing the mouse button, drag the mouse to the Guide Diamond . Notice that the Guide Diamond has five different areas. Each area corresponds to a different way of displaying or docking the window, as explained in the following image: As your mouse moves over different areas in the Guide Diamond , notice that the area turns gray to indicate it is selected. Release your mouse when your mouse is positioned over the desired screen position. Undocking a Window A window will automatically become undocked when you click on its tab or title bar. To leave the window undocked, release the mouse anywhere outside of the guide diamond. Window and Tab Display Options When you first open a model, the center pane displays the model. But sometimes using certain tools will open up a new window or tab in the center pane as well. For example, when you first opened the User Manual, it probably split the center pane into two panes with the model on the left and the User Manual on the right. By default, FlexSim splits the center pane into two panes when you open a tool that requires a separate window or tab. However, you can customize the way windows are displayed. You can dock (pin) these windows in a variety of ways for easier access, as described in the following sections. Undock the Window You can undock the tool's window and float it as an independent window, separate from the main FlexSim window: Pin the Window as a Tab You can pin the tool window to the tab bar. This allows you to display the tool as a separate tab that will fill the entire center pane. You will be able to switch between various tabs by clicking the tabs you want to view (similar to tabbed browsing in a web browser): Horizontal Split You can split the center pane horizontally with the model on either the top or the bottom pane: Vertical Split You can split the center pane vertically with the model on either the left or right pane:"
    },
    {
        "url": "https://docs.flexsim.com/en/25.2/FlexSimUI/KeyboardShortcuts/KeyboardShortcuts.html",
        "title": "Keyboard Shortcuts",
        "content": "Keyboard Shortcuts The following table describes the keyboard shortcuts are available in FlexSim: Action Keyboard shortcut Notes Create an input/output port connection between two 3D objects Press and hold the A or J key while clicking on the two 3D objects See Adding and Removing Ports for more information Remove a port connection between two 3D objects Press and hold the Q or U key while clicking on the two 3D objects See Adding and Removing Ports for more information Create a center port connection between two 3D objects Press and hold the S or K key while clicking on the two 3D objects See Adding and Removing Ports for more information Remove a center port connection between two 3D objects Press and hold the W or I key while clicking on the two 3D objects See Adding and Removing Ports for more information Connect network nodes or traffic controllers Press and hold the D key while clicking on the network nodes and/or traffic controllers Disconnect network nodes or traffic controllers Press and hold the E key while clicking on the network nodes and/or traffic controllers Change or view information on the 3D object Press and hold the X or B key while clicking on the 3D object The network node will switch the whole network through different viewing modes. The X key also creates new spline points on a network path. Racks will also toggle through different viewing modes. View input/output port connections Press and hold the V key while clicking on the 3D object If the mouse button is released first, then the information will disappear, but if the V key is released first, the information will persist. View center port connections Press and hold the C key while clicking on the 3D object If the mouse button is released first, then the information will disappear, but if the V key is released first, the information will persist. Create library objects Press and hold the F key while clicking a 3D object in the Library, then clicking in the model Create and connect library objects Press and hold the R key will clicking a 3D object in the library, then clicking in the model multiple times The new objects will be automatically connected Ignore objects Press and hold the Alt key Causes all objects in the 3D view to ignore any mouse clicks. This can be useful for moving around in a view with a lot of objects. You can also click and hold the middle mouse button and drag to move around the view, ignoring all objects. Hot Keys and Accelerators The following table describes the hot keys that are available in FlexSim: Action Keyboard shortcut Notes Start and stop the model run Ctrl + space Reset the model Ctrl + left arrow Step to the next model event Ctrl + right arrow Skip (step over all events at the next event time) Ctrl + Shift + right arrow Fast forward the model Ctrl + Shift + up arrow Increase the simulation run speed Ctrl + up arrow Decrease the simulation run speed Ctrl + down arrow Find text in the open view Ctrl + F Find and replace text in the open view Ctrl + H Copy the selected objects to the clipboard Ctrl + C Cut the selected objects to the clipboard Ctrl + X Paste the objects from the clipboard Ctrl + V Open a new tabbed document window Ctrl + T The kind of window that is open will depend on what is the currently active document window Switch to the next window tab Ctrl + Tab Switch to the previous window tab Ctrl + Shift + Tab Scale the selected objects up by 5% Ctrl + L Scale the selected objects down by 5% Ctrl + K Add a keyframe to the presentation builder Ctrl + Shift + D Close the active document window or floating window Ctrl + W Switch environments Ctrl + Alt + E If an environment is currently active, exit the environment, otherwise, enter the Minimal environment. Open the Command Helper and search for the selected text F1 Rename the selected object F2 Switch in and out of Full Screen Mode (3D View) F11 Take a screenshot of the active view P Saves it to projects folder/screenshots (adds pointer data if highlighted a node in the tree) Toggles showing the Manipulation Orb and Handles G Tree Window Shortcuts The following table describes the shortcuts that are available in the Tree Window: Action Keyboard shortcut Notes Insert a new node after Spacebar Insert a new node into Enter Delete selected nodes Delete Add number data to the highlighted node N Add string data to the highlighted node T Add object data to the highlighted node O Add pointer data to the highlighted node P Delete node data Shift + Delete Code Window Shortcuts The following table describes the shortcuts that are available in the Code Window: Action Keyboard shortcut Notes Indent the selected lines Tab Un-indent the selected lines Shift + Tab Comment or un-comment the selected lines Ctrl + /"
    }
]