[
    {
        "url": "https://docs.flexsim.com/en/25.2/Introduction/Welcome/Welcome.html",
        "title": "Welcome to FlexSim",
        "content": "FlexSim is 3D simulation software that models, simulates, predicts, and visualizes business systems in a variety of industries: manufacturing, material handling, healthcare, warehousing, mining, logistics, and more. It is both powerful and user-friendly. Make Better Decisions FlexSim can help your company make more informed decisions. You can use FlexSim to: Visualize--risk free--the results of proposed changes to optimize the flow of products, staffing, resource utilization, floor plan design, and almost any other aspect of the system Optimize your system before you implement changes in real life, saving your company time and money Study alternative investment ideas and cost reduction plans Reduce Costs Many companies have used FlexSim successfully to: Test methods for allocating resources more efficiently Reduce waiting time and queue sizes Minimize the negative effects of breakdowns Establish optimum batch sizes and part sequencing Study the effect of setup times and tool changeovers Optimize prioritization and dispatching logic for goods and services Improve Communication FlexSim can become an effective communication tool when you need to: Demonstrate new proposed business system changes to stakeholders Train employees in overall system behavior and job-related performance"
    },
    {
        "url": "https://docs.flexsim.com/en/25.2/Introduction/QuickStart/QuickStart.html",
        "title": "Quick Start",
        "content": "You can learn how to use FlexSim using the method that best matches your preferred learning style: Tutorials For a hands-on introduction to the software, consider completing some of the Tutorials in the User Manual. Be aware that if you are using the trial version of the software, you might not be able to complete all the tutorials. Training and Customer Support For one-on-one help using the software, consider taking a FlexSim class or contacting FlexSim Customer Support. See Training Classes and Customer Support for more information. The User Manual The chapters in this manual cover each of the main tasks that are involved in building a simulation model. The chapters are roughly organized in the same order you would normally complete these tasks while building a model. Each chapter also contains an overview or set of key concepts that will teach you the basic principles of model-building. Consider browsing through the topics to get a general sense of the important concepts and key tasks that are involved in simulation modeling."
    },
    {
        "url": "https://docs.flexsim.com/en/25.2/Introduction/ActivatingManagingLicense/ActivatingManagingLicense.html",
        "title": "Activating and Managing Your License",
        "content": "License Types & Features When you install FlexSim, you are installing the full software. However, the features that are available in FlexSim will depend on the license key you apply to your computer. Different license types enable different feature-sets in the software, each serving a different use case, such as Enterprise or Educational. You can visit our Answers community to read about the different FlexSim Feature Limitations by License Type and to view a table comparing the various types. If you install FlexSim but do not apply a license key, the software will be in its default, feature-limited state, called 'Express'. Read more about FlexSim Express below . To learn more about the available license types, to request an evaluation license key, or to purchase licenses, please contact your local FlexSim distributor . FlexSim Express When you first install FlexSim, it will run in 'Express' mode until you apply a license key. Express has certain feature and usage limitations, and it should only be used for evaluation and model viewing. You should not use Express to aid in making business decisions. Please see FlexSim's license agreement for allowed uses. FlexSim Express Limitations FlexSim Express includes the following model-building limitations: You can only add up to 30 3D objects to your 3D model; You can only add up to 35 process flow activities to the simulation model's process flow; The Experimenter and Optimizer tools are not available; The random number generator is fixed, meaning you won't get statistically valid results when running a simulation; Various menu options and tools may be limited or unavailable; FlexSim Express Benefits You can use FlexSim Express to: Open and run simulation models of any size. This means FlexSim Express can act as a model viewer for sharing models with users who do not have a licensed version of FlexSim; Create and save new models for evaluation purposes, up to the 3D object and process flow activity limits; Add to or modify existing simulation models for evaluation purposes, up to the 3D object and process flow activity limits. Your FlexSim Account You'll need a FlexSim Account to download software, view your license information, and to take full advantage of other FlexSim resources, like our Answers community . There are two ways to get a FlexSim Account: Sign up at https://flexs.im/account . If you already downloaded the software, you probably created your own FlexSim Account at that time. If you purchased FlexSim without previously downloading the software, you should have received an email containing your license and FlexSim Account information. If you have forgotten your password, please visit the account login page and click the Forgot Password? link. Your FlexSim Account username is your email address. If you don't know your FlexSim Account username, please contact FlexSim Customer Support . Activation ID You'll need a license key to enable features beyond those available in FlexSim Express. License keys are also known as Activation IDs. Your Activation IDs are listed in your FlexSim Account. An Activation ID is applied directly to your PC for a standalone license, or to a license server for network-based licensing. An Activation ID defines a license type (a product, like Enterprise, Educational, Runtime, etc.) and software version, as well as other attributes such as expiration dates and seat counts. The seat count defines the maximum number of computers that can use the license at one time. What does an Activation ID look like? A typical Activation ID looks like this: company.com08-ABCDE-FGHIJ-KLMNO-FSENT22.0 You can learn more about how licensing works for a given version number, and what the different parts of an Activation ID mean, in our Answers article FlexSim Version Numbering . Sharing Your Licenses Your license codes (activation IDs) are listed on the licenses page of your FlexSim Account. If you have colleagues who should also have visibility to your license codes, you can \"share\" your licenses with their account. When you share your licenses with another FlexSim Account, they are able to view all of your activation IDs in full, as well as the activation histories of those licenses. Instructions for sharing your licenses Licensing FlexSim Interacting with your licenses isn't something you do every day, but it doesn't need to be intimidating. We've documented all the main procedures you'll use to manage your FlexSim licenses like a pro. When you purchased your FlexSim licenses, you or your company chose one of two methods for licensing your software: a local license server standalone licensing Read on for instructions on managing both types of licensing. Local License Server With a local license server, rather than activating a license directly in the software (as in standalone licensing ), your FlexSim software is configured to obtain a seat from a license server in your organization's network. These links take you to detailed instructions for all the primary licensing tasks you may need when managing your network-license-server-based licenses. Install, Configure, Activate This is everything you need to get started with a local, network-based FlexSim license server, including instructions for installing, configuring, and licensing your server, and for configuring FlexSim to get a seat from your license server. This document covers both online and secure/offline scenarios. https://flexs.im/licenseserver-install Return You may occassionally need to move your network licenses to a new license server, or return your license as part of a version upgrade. License Server - Return - Online License Server - Return - XML / Offline Repair In rare circumstances, your activated license can become 'broken'. This means that, even though the license is still activated on your server, it is no longer able to serve seats to client PCs. This can happen if your server hardware or operating system changes significantly. License Server - Repair - Online License Server - Repair - XML / Offline Upgrade FlexSim releases a new feature-version several times per year. In order for client PCs to be able to run a licensed version of the upgraded software, you'll need to upgrade the activated license on your license server. Licenses with a current maintenance subscription are eligible to be upgraded to the new version. License Server - Upgrade - Online License Server - Upgrade - XML / Offline You can learn more about how licensing works for a given version number in our Answers article FlexSim Version Numbering . Standalone Licensing Standalone licensing is accomplished when you activate an Activation ID directly in FlexSim. These links take you to detailed instructions for all the primary licensing tasks you may need to manage your standalone licenses: Activation To apply a license to your computer, follow the linked instructions depending on whether your computer allows FlexSim to communicate online. Standalone - Activation - Online Standalone - Activation - XML / Offline Return Returning your license removes it from your computer, and makes your seat available for a new activation. This is useful if you need to free up a seat for a colleague, or move your license to a different computer. You may also return your license as part of the upgrade process for a new version of FlexSim - returning the old version so that you can activate an upgraded Activation ID. Standalone - Return - Online Standalone - Return - XML / Offline Repair In rare circumstances, your activated license can become 'broken'. This means that, even though the license is still activated on your computer, it no longer enables additional features allowed by your license type. This can happen if your computer hardware or operating system changes significantly. There is no online method available. Standalone - Repair - XML / Offline Upgrade FlexSim releases several new feature-versions per year. An upgraded version of the software requires an updated license key to enable its licensed features. Licenses with a current maintenance subscription are eligible to be upgraded to the new version. Standalone - Upgrade - Online Standalone - Upgrade - XML / Offline You can learn more about how licensing works for a given version number in our Answers article FlexSim Version Numbering ."
    },
    {
        "url": "https://docs.flexsim.com/en/25.2/Introduction/CustomerSupport/CustomerSupport.html",
        "title": "Customer Support",
        "content": "Sales and Services Questions For sales questions, or for more information regarding services offered by FlexSim, including training and consulting, please contact your local FlexSim distributor . Technical Questions For technical support, please visit FlexSim's Answers Community . Answers Community FlexSim's support staff, developers, and worldwide partners, along with fellow community members, are on hand to help you with your simulation questions. As you search the community, you may find that your question has already been answered in a previous post. Still not finding the answers you need? Log in to ask your own question. Please be sure to review the community's best practices before making your first post. We prefer that most questions be posted publicly, so that answers can benefit FlexSim's worldwide community. Confidential information and model files can be shared by choosing to make your question Private. Private questions are only visible to FlexSim's US-based support staff. Please see the best practices for more information regarding public vs private questions, as well as other considerations when using the Answers community. Direct Support To speak directly with a FlexSim representative, or for email, phone, or web-based support, please contact your local FlexSim distributor . Active software maintenance is required for direct support. Contact your local FlexSim distributor for more information."
    },
    {
        "url": "https://docs.flexsim.com/en/25.2/Introduction/TrainingClasses/TrainingClasses.html",
        "title": "Training Classes",
        "content": "FlexSim training sessions are held regularly throughout the world. Most scheduled training sessions can be found at https://www.flexsim.com/calendar/ . Training sessions for first-time FlexSim users typically include a multi-day hands-on course. Attendees learn to use the software by creating and analyzing simulation models. Some training courses may include extra days for additional one-on-one instruction or model-building help, where attendees can be paired with a FlexSim engineer to start a simulation project. Your local FlexSim distributor may be hosting training at additional times and locations. Contact your distributor for availability, details, and pricing."
    }
]