[
    {
        "url": "https://docs.flexsim.com/en/25.2/Tutorials/FlexSimHC/OverviewFlexSimHC/OverviewFlexSimHC.html",
        "title": "FlexSim Healthcare Tutorial",
        "content": "This tutorial task will teach you some of the basics about the FlexSim Healthcare (HC) 3D objects and process flow activities. These objects and activities are designed to be as intuitive, user-friendly, and visually engaging as possible. Although these objects are primarily designed for simulating health care systems, these objects can be used in FlexSim generally to simulate business systems that are based around the flow of people rather than items. For that reason, these objects are sometimes referred to as people objects in FlexSim. These people objects and process flow activities could be designed to simulate customer-facing businesses such as grocery stores, airports, restaurants, customer service centers, etc. In other words, they can simulate any system in which customers interact with different elements of the business system. In this tutorial, you'll simulate a walk-in health care clinic. Patients will arrive, register at the front desk, and receive treatment. When you're finished, your simulation model will look similar to the following image: Tasks Covered This tutorial will cover the following tasks: Task 1.1 Use an Activity Set In this tutorial task, you'll learn how to use a patient flow and add activity sets to build flows that will control the logic and behavior of people as they interact with the various objects in the system. Task 1.2 Add Staff In this tutorial task, you'll add staff members and learn how to use staff and location groups. You'll also use more activity sets to build more of the patient track and get more experience with FlexSim Healthcare objects and activities. Task 1.3 Add Transports and Equipment In this task, you'll build out two different possible treatment tracks for the patient. These different treatment tracks will teach you how to use transports and equipment, which are a special class of objects in FlexSim Healthcare models. You'll then change the patient arrival pattern so that patients will begin to arrive at the clinic at higher rates. Lastly, you'll add a couple charts to demonstrate displaying the data collected by the model. Task 1.4 Add A* Navigation In this tutorial task, you'll learn how to use A* navigation to designate where the patients and staff members can walk and where they cannot. Task 1.5 Create Independent Staff Tasks In this task, you'll learn how to create independent staff tasks, which are tasks that are not tied to a specific patient that is currently in the system. You'll learn how to add a maintenance task to a location after it has been used and you'll learn how to create routine tasks that might temporarily take a staff member away from caring for a patient. Lastly, you'll learn how to create a shift schedule for staff members that will determine when they are available to work. Task 1.6 Add a Custom Location Object In this tutorial task, you'll learn how to add a custom location object by creating a meeting place where two staff members can consult with each other."
    },
    {
        "url": "https://docs.flexsim.com/en/25.2/Tutorials/FlexSimHC/1-1UseActivitySet/1-1UseActivitySet.html",
        "title": "Tutorial Task 1.1 - Use an Activity Set",
        "content": "Task Overview FlexSim Healthcare's 3D objects and process flow activities make it easy to build a variety of health care simulation models, such as hospitals, emergency rooms, clinics, etc. In this tutorial task, you'll learn about the basics of building a FlexSim Healthcare (HC) model. You'll learn how to: Switch to the FlexSim Healthcare environment Add a floor plan to a 3D model Add locations to your 3D model Build a process flow that will create people inside the 3D model Use an activity set in a process flow for faster logic building To teach you how to use the FlexSim Healthcare 3D objects and process flows, you'll build a portion of a walk-in health care clinic. In this tutorial task, you'll only build the section of the system that handles new patient arrivals. You'll add the necessary objects and create the basic behavior of a patient that arrives at the clinic and registers at a kiosk. When you're finished with this task, your model will look similar to the following image: New to FlexSim? If you're new to FlexSim, you might want to familiarize yourself with the FlexSim user interface. Consider reading the Overview of the FlexSim Interface topic or completing the FlexSim Basics tutorial. Step 1 Add a Floor Plan In this step, you'll create a new model and switch to the FlexSim Healthcare environment. Technically, this step is unnecessary because you can access all the same 3D objects and process flow activities without being in this environment. For example, you can access the FlexSim Healthcare 3D objects in the Library under the People group and you can access the FlexSim HC process flow activities in the Library in various People groups near the bottom of the process flow library. However, when you switch to the FlexSim Healthcare environment, those specific 3D objects and process flow activities will move to the top of their respective libraries, making them easier to access. The overall interface, the main toolbar, and organization of objects in the library also becomes simpler and more streamlined for building health care models. After switching to the Healthcare environment, you will add a floor plan of the clinic that you will simulate in this tutorial. This floor plan was included with FlexSim when you installed the software. When you're finished adding the floor plan, your model should look similar to the following image: To switch to the FlexSim Healthcare environment and add a floor plan: Create a new model using the default settings. In the top right corner of the main window (above Properties), click the Change Environment button to open a menu. Select Healthcare to switch to the FlexSim Healthcare environment. On the main toolbar, click the Floor Plans button to open a menu. Select Add a Floor Plan to add a new floor plan and open its Model Background Properties window. In the Background tab, next to the File name box click the Browse... button to open your computer's file directory. Navigate to your computer's Documents folder, then to the FlexSim 2020 Projects folder. Double-click the ER_small.dwg file to select it. You'll use the default settings for the drawing's spatials. In the Layers tab, you can click the colored box next to any of the layers to change the color of that layer. Check to ensure your 3D model looks similar to the image in the beginning of this step. Step 2 Add Locations to Your 3D Model The FlexSim Healthcare 3D Library has a set of objects that are specifically designed for building health care models. In this step, you'll learn how to add FlexSim Healthcare locations and multi-locations to a 3D model. If you're familiar with FlexSim in general, locations are similar to fixed resources for flow items in the standard FlexSim environment. Patients will move to these locations and interact with them based on the type of object they are. Usually the interaction will involve changing something about the patient's visuals or animations while they arrive at, use, or exit the location. For example, when patients interact with a chair, it will animate them sitting in a chair. You'll also add a multi-location to your 3D model in this step. A multi-location is a location that contains a group of related locations. When a patient attempts to acquire the multi-location, any of the individual locations in this group could be acquired. In this model, you'll add a chairs multi-location to represent chairs in a waiting room area. Each individual chair can potentially be acquired by the patients, but you don't need to add each chair to the model; you can simply add the group of chairs. At this point, you'll just build the registration area of the model, which will include an entrance and exit for patients, a registration kiosk where they will sign in when they arrive, and a waiting area. When you're finished, your 3D model will look similar to the following image: To add these locations to your model: In the left pane, click the Library tab to open the Library. Under the Healthcare group of objects, click the Location object to open a menu of location objects. Drag a Kiosk object into the 3D model. (Use the image at the beginning of this section as a guide for the placement of objects.) Rotate the kiosk 180 degrees. (Right-click and then drag the blue sizer arrow to rotate the object or use Properties to change the Z-rotation to 180 ) In the Library under the Healthcare group, click the Prop object to open a menu of prop objects. Drag a Glass door (under the Doors group) into the 3D model. In the Library under the Healthcare group, click the MultiLocation object to open a menu of multi-location objects. Drag the Chairs object into the model. In the 3D model, click the Chairs1 multi-location to select it. In Properties, rename the object WaitingRoom . Rotate the waiting room 45 degrees. Check to make sure your 3D model looks similar to the image shown at the beginning of this step. Step 3 Add a Patient Flow In this step, you'll learn how to set up process flows. The Process Flow tool allows you to build a flowchart of your model's logic. Inside that flowchart, you'll add activities that contain small chunks of pre-programmed logic or instructions. When a simulation model runs, small green circles called tokens move through the process flow activities, performing each activity's instructions. New to FlexSim? Consider reading Introduction to Model Logic for more general information about process flows. You might also want to read the Overview of the Process Flow Interface for an introduction to the basic terms and concepts related to the Process Flow tool. In this step, you'll create two process flows. One will be a patient process flow that you'll use to control how the patient interacts with the 3D model after it has been created. The second will be a general process flow named Arrivals that will control how frequently patients will be created inside the 3D model. Inside the Patient Flow process flow, you'll add activity sets that direct the patient's flow through the model. FlexSim Healthcare models have several activity sets you can use to build your simulation model's logic. Activity sets are groups of process flow activities that have been pre-programmed to accomplish some of the most common logical tasks in FlexSim Healthcare models. See Activity Sets for more information. To add and set up a patient flow: On the main toolbar, click the Patient Flows button to open a menu. Select Add a Patient Process Flow to create a new process flow. You'll notice two process flows will open in a separate window. Click the Arrivals tab to open it. Notice that there is a stacked block of four activities in this process flow. The first creates tokens according to a specified schedule. The second creates a patient in the 3D model and attaches them to the Patient Flow. The third randomizes their appearance and the fourth removes the token. Click the icon of the Create Patient activity to open its properties. Next to the Destination box, click the Sampler button to enter sampling mode. In the 3D model, click Glass Door1 to sample it. Notice that the Patient Flow box indicates that it is linked to the Patient Flow process flow. Click the Patient Flow tab to open it. Notice that this process flow already has a Schedule Source activity. A token will be created in this activity whenever a patient is created by the Create Patient activity in the Arrivals flow. Step 4 Add Activity Sets in Process Flow The activity sets you'll add in this step contains activities that will instruct a patient to acquire a location, walk to it, and spend some time there. When you're finished, your process flow should look similar to the following image: For now, you'll merely add and connect these activities. You'll edit the properties to add logic in a later step. Renaming Activities as a Best Practice You could use the default activity and shared asset names that are part of the activity set. However, your model will be much easier to work with if you give your activities and shared assets custom names. Try to give activities specific names that indicate the purpose of the activity and how it functions in the model. Feel free to resize activities if a longer name would communicate more clearly. To add and connect these activities: In the Library under the HC Activity Sets group, drag a Walk then Process activity set into the Patient Flow process flow. See Walk then Process for more information about how the activities in this activity set work together. Alternative Methods of Adding Activities The Process Flow tool has a few different methods for adding activities. You might want to familiarize yourself with different methods to determine which method you prefer. See Adding and Connecting Activities for more information. Double click on the text above the container and rename the container Sign In . Double click the Location resource and rename it Kiosk . Create a connector from the Source activity to the edge of the Sign In container. Double click in blank space to open the Quick Library. Under the HC Activity Sets group, click Walk then Process to add another activity set into the Patient Flow process flow. Rename the container Wait . Rename the Location resource Waiting Room . Create a connector from the bottom edge of the Sign In container to the top edge of the Wait container. Press and hold the Ctrl key. Click the Process activity in the Wait container and drag it out of the stacked block. Delete the Process activity. Check to ensure that your patient flow looks similar to the image at the beginning of this step. Step 5 Edit the Activity Properties In this step, you'll edit the properties for the activities in the process flow. One important concept to keep in mind is that in this tutorial you'll use a process flow instance for each patient that is created by the Arrivals process flow. That means that each patient will run its own individual copy of the PatientFlow process flow based on the template you'll build for the patient in this step. See Process Flow Instances for more information about how process flow instances work. In practical terms, this means that any time you see the keyword patient in the properties for an activity, it will refer to the current patient that is running this instance of this process flow. The token that runs through that instance will be tied to that patient. You Can Also Build This Logic in a General Process Flow In this tutorial task, you'll learn how to build an instanced process flow, but you could just as easily build this same activity sequence in a general process flow as well. Be aware that you'd need to use token labels in place of the keyword patient if you were to build it in a general process flow. To edit these properties: Click the icon of the Kiosk activity to open its properties. Next to the Location box, click the Sampler button and sample the Kiosk1 object in the 3D view. Click the icon of the Waiting Room activity to open its properties. Next to the Location box, click the Sampler button and sample the WaitingRoom object in the 3D view. Click the icon of the Process activity in the Sign In container to open its properties. In the Process Time field change minutes(10) to minutes(3) What Does This Code Mean? The Process Time property determines how long the process should take in model time units. So entering 15 here would make the process take 15 seconds if your model is using seconds for its time units or 15 minutes if it's using minutes. The minutes() command will convert 15 minutes into model time units so that no matter what time units the model is using the process will always be 15 minutes. There are similar commands for hours and years. Consider saving your simulation model at this point. Step 6 Test Your Model In this step, you'll run your simulation model. In general, it's a good idea to regularly test your model logic after you've built a small section of it. When you run the model, you'll notice errors or things that didn't work as expected. See Running a Simulation Model for more information. To run the model, press the Reset button on the simulation control bar to clear the simulation and reset it to its starting values. Press the Run button to start the simulation and Stop button to stop it. Step Over Dead Time When the patient reaches the process activity they will spend several minutes there not moving. You can press the Step button to jump forward in time to the next model event or the Skip button to step to the next model event and run all events at that same model time. As you watch the 3D model, the patient arrives through the door, walks to the kiosk and then to the waiting room: Notice that the actions in the 3D model correlate with what is happening in the PatientFlow process flow. As the tokens move through the process flow, they correlate with the patient's actions in the 3D model. The process flow activities take care of all the actions and logic for the patient as it interacts with different types of locations and staff members. Conclusion At this point, you've created the first phase of your health care clinic simulation model. You've added a few FlexSim Healthcare 3D objects to your model and you've seen how to build the model's logic using the process flow tool and the people activity sets. In the next tutorial, you'll continue building out the rest of the patient track for the health care clinic and you'll learn how to use staff. Continue on to Tutorial Task 1.2 - Add Staff"
    },
    {
        "url": "https://docs.flexsim.com/en/25.2/Tutorials/FlexSimHC/1-2AddStaff/1-2AddStaff.html",
        "title": "Tutorial Task 1.2 - Add Staff",
        "content": "Task Overview In this tutorial task, you'll build more of the patient track for the health care clinic model to get some additional practice using the FlexSim Healthcare objects and activities. In the first tutorial task, you learned how to use one of the activity sets to quickly set up the logic of your patient track. In this tutorial task, you'll use a few more activity sets that let the patient acquire staff and give them tasks. When you're finished, your simulation model should look similar to the following image: Step 1 Add Staff and Additional Locations In this step, you'll build out a little more of the 3D objects in the health care clinic by adding some more FlexSim Healthcare locations and staff objects to the model. In this step, you'll see what it's like to add several copies of the same object at the same time using the Create Objects mode. When you're finished, your model should look similar to the following image: To add these additional 3D objects: In the Library under the Healthcare group, click the Location object to open a menu. Click (don't drag) the Exam Table to enter Create Objects mode. Your mouse pointer will change to the Create Objects icon when you're in Create Objects mode. Click the area in the model where you want to add the first exam table. (Use the image at the beginning of this step to guide you on the placement of objects.) While still in Create Objects mode, click inside the model to add a second Exam Table . Repeat the previous step to add more Exam Tables until there are a total of 4 tables in the model. Press Esc or right click to exit Create Objects mode. Click Exam Table 3 to select it. In Properties, change the Z-rotation to 180.00 . Repeat this step for Exam Table 4 as well. From the Location menu, drag a Scale into the 3D model. Change the scale's Z-rotation to 90.00 . From the Location menu, drag a Computer Desk into the 3D model. Change the desk's Z-rotation to 90.00 . In the Library under the Healthcare group, click the Prop object to open a menu of prop objects. Drag a Nurse Station B (under the Rooms group) into the 3D model. Click Nurse Station B1 to select it. In Properties, change the Z-rotation to 90.00 . In the Library under the Healthcare group, click the Staff object to open a menu. Drag an RN (Female) and an RN (Male) into the model. In the Library under the Healthcare group, click the Staff object to open a menu of staff objects. Drag an MD (Female) and an MD (Male) into the model. Check to make sure your simulation model looks similar to the image at the beginning of this step. Step 2 Create Object Groups In this step, you'll learn how to add staff objects to your 3D model. You'll then learn how to create staff and location object groups. You'll also explore how groups work with FlexSim Healthcare 3D objects in general by exploring groups in the Toolbox. See Creating 3D Object Groups for more information about groups. Using 3D Object Groups as a Best Practice Groups are very important for managing FlexSim Healthcare models. Creating and managing groups is a good best practice for making your models scale well as they become more complex. Groups allow you to add additional objects to your model without having to constantly update your model's logic. By default, all locations are automatically added to one of the main object groups: the Locations group. In a similar vein, all staff are added to the Staff group. However, you also have the ability to create additional groups or sub-groups to better organize your model. As you'll see in a later step, these groups are important to building the logic for FlexSim Healthcare objects. Since you added several new 3D objects to your simulation model in the previous step, you need to create object groups for those new objects in order to make your model scale well. In this step, you'll create a location group named ExamRooms for the new exam tables and you'll create staff groups named MDs and RNs for the MD and RN staff members. To create these object groups: Press and hold down the Shift key while using your mouse to draw a box around all four of the new ExamTable objects you added to your model in the previous step. A red box will appear around the ExamTables to show they are selected. Right-click ExamTable1 to open a menu. Point to Location Groups , then select Add to New Group to open a group properties window. In the name box, rename the group ExamRooms . Notice that all four of the ExamTables are members of the group. Close the group window. Press and hold down the Shift key while clicking a blank area in the 3D model with your mouse to de-select the ExamTables. In the 3D model, press the Ctrl button and click MD1 to select it. While still pressing the Ctrl key, click MD2 to select it as well. Right-click MD1 to open a menu. Point to Staff Groups , then select Add to New Group to open a group properties window. In the name box, delete the current text and rename the group MDs . Notice that MD1 and MD2 are both listed as a member and that Staff is listed as the parent group. Close the group window. Press and hold down the Shift key while clicking a blank area in the 3D model with your mouse to de-select the MDs. Add RN1 and RN2 to a new Staff Group named RNs the same way you added MD1 and MD2 to the MDs group. Remember to press and hold down the Shift key while clicking a blank area in the 3D model with your mouse to de-select the RNs. Consider saving your simulation model at this point. Step 3 Add Activity Sets for Bed Placement In this step you'll use the Escort then Process activity set to model the patient being escorted to the scale and then to an exam table. In this step, you'll also see how the staff groups you set up earlier in the tutorial will be used in this model's logic. When a staff member is required to help a patient, you can assign any member of the group to help the patient (as opposed to assigning a specific staff member). When needed, the process flow will select the first available member of this group to work on a task. Using object groups will help your model scale well as it becomes more complex. It makes it so that you can add extra chairs, clerks, nurses, etc. as needed without having to change the model's logic. When you add new objects to the 3D model, all you will have to do is add the new members to the group and FlexSim Healthcare will take care of the rest of the logic. These object groups also make it possible to easily study the impact of adding additional staff or location resources to your model to find the most efficient use of resources. When you're finished, your process flow should look similar to the following image: To add and connect these activities: In the Library under the HC Activity Sets group, drag an Escort then Process activity set into the Patient Flow process flow. See Escort then Process for more information about how the activities in this activity set work together. Create a connector from the bottom edge of the Wait container to the top edge of the new container. Rename the container Weigh at Scale . Rename the Location resource Scale . Rename the Staff resource RN . Click the icon of the Scale activity to open its properties. Next to the Location box, click the Sampler button and sample the Scale1 object in the 3D view. Click the icon of the RN activity to open its properties. Next to the Staff box, click the Sampler button and sample any of the RN objects in the 3D view. Choose the RNs group option from the menu so that the field now reads Any member of RNs . Click the icon of the Process activity to open its properties. In the Process Time field change minutes(10) to minutes(1) . Press and hold the Ctrl key. Click the Release RN activity, drag it out of the stacked block, and delete it. We are doing this because we will continue to use the RN we acquire in this activity set in the following activity set. In the Library under the HC Activity Sets group, drag another Escort then Process activity set into the Patient Flow process flow. Create a connector from the bottom edge of the Weigh at Scale container to the top edge of the new container. Rename the container Bed Placement . Rename the Location resource Exam Table . Click the icon of the Exam Table activity to open its properties. Next to the Location box, click the Sampler button and sample any of the Exam Table objects in the 3D view. Choose the ExamRooms group option from the menu so that the field now reads Any member of ExamRooms . Click the icon of the Staff resource to open its properties. Next to the Staff box, click the Sampler button and sample the RN staff resource in the Weigh at Scale container so that the field now reads Reference to RN . This means that the staff we want to use in the Bed Placement activity set is the same RN we used in the Weigh at Scale activity set. Press and hold the Ctrl key. Click the Acquire RN activity, drag it out of the stacked block, and delete it. We are doing this because the RN we're using was already acquired in the previous container and has not been released yet. Press and hold the Ctrl key. Click the Acquire Exam Table activity, drag it out of the stacked block, and drag it into the stacked block inside the Weigh at Scale container such that it is now the first activity in the block. We are doing this because we don't want the patient to be escorted to the scale until there is an open exam room to go to. Check to ensure that your patient flow looks similar to the image at the beginning of this step. Step 4 Add Activity Sets for Exam and Departure In this step you'll use the Process with Staff, the Two Staff Meet, and the Escort to Exit activity sets to model the patient being seen by an MD, the RN and MD discussing the patient, and then the patient being escorted to the exit. We will also see how to refer to resources acquired in an earlier activity set. When you're finished, your process flow should look similar to the following image: To add and connect these activities: In the Library under the HC Activity Sets group, drag a Process with Staff activity set into the Patient Flow process flow. See Process with Staff for more information about how the activities in this activity set work together. Create a connector from the bottom edge of the Bed Placement container to the top edge of the new container. Rename the container MD Exam . Rename the Staff resource MD . Click the icon of the MD activity to open its properties. Next to the Staff box, click the Sampler button and sample any of the MD objects in the 3D view. Choose the MDs group option from the menu so that the field now reads Any member of MDs . Click the icon of the Process activity to open its properties. In the Process Time field change minutes(10) to minutes(30) . In the Library under the HC Activity Sets group, drag a Two Staff Meet activity set into the Patient Flow process flow. See Two Staff Meet for more information about how the activities in this activity set work together. Create a connector from the bottom edge of the MD Exam container to the top edge of the new container. Rename the container Consult . Click the icon of the Staff1 resource to open its properties. Next to the Staff box, click the Sampler button and sample the RN* staff resource in the Bed Placement container so that the field now reads Reference to RN . Click the icon of the Staff2 resource to open its properties. Next to the Staff box, click the Sampler button and sample the MD staff resource in the MD Exam container so that the field now reads Reference to MD . Click the icon of the Office variable to open its properties. Next to the Variable or Value box, click the Sampler button and sample the Computer Desk1 object in the 3D view. In the Library under the HC Activity Sets group, drag an Escort to Exit activity set into the Patient Flow process flow. See Escort to Exit for more information about how the activities in this activity set work together. Create a connector from the bottom edge of the Consult container to the top edge of the new container. Click the icon of the Staff resource to open its properties. Click the arrow next to the Staff box to open a menu. Point to Previous Staff Resource , then select RN so that the field now reads Reference to RN . Click the icon of the Exit variable to open its properties. Next to the Variable or Value box, click the Sampler button and sample the Glass Door1 object in the 3D view. Press and hold the Ctrl key. Click the Release Exam Table activity in the Bed Placement container, drag it out of the stacked block and into the Escort to Exit container so that it's the first activity in the stacked block. We are doing this because we don't want to release the exam table until the patient is ready to leave. Check to ensure that your patient flow looks similar to the image at the beginning of this step. Consider saving your simulation model at this point. Step 5 Test Your Model As you watch the 3D model, the patient is escorted from the waiting room to the scale and then to to an exam table. A doctor then examines the patient and consults with the nurse. The patient is then escorted to the exit: Notice also that the nurse and patients walk through the floor plan walls, taking the shortest distance between two points. You'll learn how to fix this problem in a future tutorial. Conclusion Up to this point, you've created a simulation model of a health care clinic in which a patient is seen by a doctor and then leaves. In the next tutorial we'll add a branching path to the flow so that the patient recieves one of two possible tests. Continue on to Tutorial Task 1.3 - Add Transports and Equipment ."
    },
    {
        "url": "https://docs.flexsim.com/en/25.2/Tutorials/FlexSimHC/1-3AddTransportsEquipment/1-3AddTransportsEquipment.html",
        "title": "Tutorial Task 1.3 - Add Transport and Equipment Objects",
        "content": "Task Overview In this task, you'll build out two different possible treatment tracks for the patient. These different treatment tracks will teach you how to use transports and equipment, which are a special class of objects in FlexSim Healthcare models. In the first track, a tech will get an EKG machine from a storage area to monitor the patient. In the second track, the patient will be transported to the x-ray room for radiology and then transported back to the exam room using a wheelchair. You'll build and test each track in this tutorial. When you're finished, your simulation model should look similar to the following image: Step 1 Add Additional Locations, Equipment, and Staff In this step, you'll add additional location objects and staff objects to the 3D model. You'll also add some transport objects to the model (wheelchairs) and an equipment object (an EKG machine). Lastly, you'll also add some additional staff members to this model and create a group for the new staff members. When you're finished, your simulation model should look similar to the following image: To make these changes: Make sure the 3D model is open and active and that you are in the FlexSim Healthcare environment. In the Library under the Healthcare group, click the Location object to open a menu of location objects. Drag an Xray object into the model. (Use the image at the beginning of this step as a guide on the placement of objects.) Click Xray1 to select it. In Properties, change the Z-rotation to 90.00 . In the Library under the Healthcare group, click the Transport object to open a menu. Click (don't drag) the Wheelchair to enter Create Objects mode. Your mouse pointer will change to the Create Objects icon when you're in Create Objects mode. Click the area in the model where you want to add the first wheelchair. While still in Create Objects mode, click in the model to add a second Wheelchair . In the Library under the Healthcare group, click the Equipment object to open a menu of location objects. Drag a PortableEKG object into the model. In the Library under the Healthcare group, click the Staff object to open a menu. Click (don't drag) the Tech to enter Create Objects mode. Click in the model to create the first Tech. While still in Create Objects mode, click in the model to add a second Tech . Check that your simulation model looks similar to the image at the beginning of this step. Step 2 Create Additional Object Groups Since you added several new 3D objects to your simulation model in the previous step, you need to create object groups for those new objects in order to make your model scale well. In this step, you'll create an equipment group named EKGs for EKG machine, a transport group named Wheelchairs , and a staff group named Techs . To create additional object groups: Press and hold down the Shift key while using your mouse to draw a box around all of the Wheelchair objects. A red box will appear around the Wheelchairs to show they are selected. Right-click Wheelchair1 to open a menu. Point to Transport Groups , then select Add to New Group to open a group properties window. In the Group Name box, rename this group Wheelchairs . Close the group window. Press and hold down the Shift key while clicking a blank area in the 3D model with your mouse to de-select everything. In the 3D model, press the Ctrl button and click Tech1 to select it. While still pressing the Ctrl key, click Tech2 to select it as well. Right-click Tech1 to open a menu. Point to Staff Groups , then select Add to New Group to open a group properties window. In the Group Name box, rename this group Techs . Close the group window. Press and hold down the Shift key while clicking a blank area in the 3D model with your mouse to de-select everything. In the 3D model, right-click PortableEKG1 to open a menu. Point to Equipment Groups , then select Add to New Group to open a group properties window. In the Group Name box, rename this group EKGs . Close the group window. Consider saving your model at this point. Step 3 Use Equipment in a Treatment Phase In this step, you'll learn how to work with equipment in FlexSim Healthcare models. You'll add a treatment option in which a Tech will get an EKG machine from its storage area and use it to test the patient. When the patient is done being tested, the Tech will return the EKG machine to its storage closet. When you're finished, the process flow will look similar to the following image: To build this logic: In the PatientFlow process flow, press and hold down the Shift key while using your mouse to draw a box around the Consult and Escort to Exit containers. The containers will highlight yellow to show they are selected. Click on one of the highlighted containers and then drag downwards to move the containers down so we'll have some room to insert some more activities. From the Library under the Basic group, drag a Decide activity into the space we just made. Rename this activity Treatment Type? . Find the connector between the MD Exam and Consult containers. Click on the arrow end of the connector and drag it to the top edge of the Treatment Type? activity. Add a Move Equipment then Process activity set (under HC Activity Sets ). See Move Equipment then Process for more information about how the activities in this activity set work together. Create a connector from the bottom edge of the Treatment Type? activity to the top edge of the new container. Rename this container EKG . Rename the Equipment resource EKG . Rename the Staff resource EKG Tech . Create a connector from the bottom edge of the EKG container to the top edge of the Consult container. Click the icon of the EKG activity to open its properties. Next to the Equipment box, click the Sampler button and sample the EKG1 object in the 3D view. Choose the EKGs group option from the menu so that the field now reads Any member of EKGs . Click the icon of the EKG Tech activity to open its properties. Next to the Staff box, click the Sampler button and sample one of the Tech objects in the 3D view. Choose the Techs group option from the menu so that the field now reads Any member of Techs . From the Library under the HC Sub Flows group, drag a Move Equipment activity into the process flow and insert it after the Process activity. Inserting Activities into Stacked Blocks See Inserting an Activity into a Stacked Block for more information about different methods for inserting activities into blocks. Rename the new Move Equipment activity Return EKG . Click the icon of the Return EKG activity to open its properties. Next to the Equipment box, click the Sampler button and sample the EKG resource so that the field now reads Acquired EKG . Click the arrow next to the Destination box to open a menu. Select Equipment's Reset Position . Next to the Staff box, click the Sampler button and sample the EKG Tech resource so that the field now reads Acquired EKG Tech . Save, then reset and run the simulation model. After the MD Exam phase, a Tech brings the EKG machine to the patient. After a brief delay, the Tech then returns the EKG to its storage room. Step 4 Use a Transport in a Treatment Phase In this step, you'll add the second treatment track to the PatientFlow process flow. You'll add a treatment track in which the patient is taken to get an x-ray. This treatment track will show you how to work with transport objects because the patient will need to be transported to and from the x-ray on a wheelchair. When you're finished, the process flow will look similar to the following image: To build this logic: Add a Transport Patient then Process activity set (under HC Activity Sets ). See Transport Patient then Process for more information about how the activities in this activity set work together. Create a connector from the bottom edge of the Treatment Type? activity to the top edge of the new container. Rename this container Xray . Rename the Location resource Xray . Rename the Transport resource Wheelchair . Rename the Staff resource Tech . Create a connector from the bottom edge of the Xray container to the top edge of the Consult container. Click the icon of the Xray activity to open its properties. Next to the Location box, click the Sampler button and sample the Xray1 object in the 3D view. Click the icon of the Wheelchair activity to open its properties. Next to the Transport box, click the Sampler button and sample one of the Wheelchair objects in the 3D view. Choose the Wheelchairs group option from the menu so that the field now reads Any member of Wheelchairs . Click the icon of the Tech activity to open its properties. Next to the Staff box, click the Sampler button and sample one of the Tech objects in the 3D view. Choose the Techs group option from the menu so that the field now reads Any member of Techs . From the Library under the HC Sub Flows group, drag a Move Equipment activity into the process flow and insert it after the Process activity. Rename the Move Equipment activity Return Wheelchair . Click the icon of the Return Wheelchair activity to open its properties. Next to the Equipment box, click the Sampler button and sample the Wheelchair resource so that the field now reads Acquired Wheelchair . Click the arrow next to the Destination box to open a menu. Select Equipment's Reset Position . Next to the Staff box, click the Sampler button and sample the Tech resource so that the field now reads Acquired Tech . From the Library under the HC Sub Flows group, drag a Transport Patient activity into the process flow and insert it after the Process activity. Click the icon of the new Transport Patient activity to open its properties. Next to the Destination box, click the Sampler button and sample the Exam Table resource in the Bed Placement container so that the field now reads Acquired Exam Table . Next to the Staff box, click the Sampler button and sample the Tech resource so that the field now reads Acquired Tech . Next to the Transport box, click the Sampler button and sample the Wheelchair resource so that the field now reads Acquired Wheelchair . What Does This Code Mean? The default code patient.Locations[1] is a reference to the last location that the patient acquired. Since you only want to test this new track right now, click the icon of the Treatment Type? activity to open its properties. In the Send Token To box, delete the current number and type 2 . Save, then reset and run the simulation model. After the MD Exam phase, a tech grabs a wheelchair then comes and transports the patient to the x-ray machine and takes an x-ray of the patient. The tech then returns the patient to their exam room. Step 5 Change the Patient Arrival Schedule Now that you've built out a fairly complex simulation model and tested it, it's time to increase the number of patients that move through the health care clinic model. In this step, you'll change the patient arrival schedule on the Date Time Source activity in the Arrivals process flow. Patients in a walk-in clinic often arrive at varying rates depending on the time of day. The Date Time Source activity will allow you to define the number of patients arriving within different time periods of the day. To change the patient arrival pattern: Open the Arrivals process flow. Click the icon of the Source activity to open its properties. Click the Edit Arrivals button to open this activity's expanded properties window. In the Rows box change the number of rows from 1 to 18 . Close the properties window. Save your model. Reset and run the simulation model. A new patient should now arrive every 30 minutes. Step 6 Assign Patients to Different Treatments Now that you've built and tested each of the different treatment tracks, we'll randomly distribute patients between the two treatment tracks. We could do this directly in the Treatment Type? decide activity, but we're going to create two different labels sets and have the decide activity read the value of the Treatment label off the patient. Open the Toolbox in the left pane. Find the People Settings object and double click on it to open its properties. Add a label set. Add a number label and rename it Treatment . Set the value of Treatment to be 1 for LabelSet1 and 2 for LabelSet2. Close the window. Open the Arrivals process flow. Click the icon of the Create Patient activity to open its properties. Click the arrow next to the Label Set box to open a menu. Select Label Set by Percentage . Fill out the popup so that 50% of patients are assigned the first label set and the other 50% are assigned the second label set. Open the Patient Flow process flow. Click the icon of the Treatment Type? activity to open its properties. In the Send Token To box type patient.Treatment . Save, then reset and run the simulation model: As you watch, notice that the patients will randomly be assigned to one of the two different treatment tracks. Step 7 Add Charts Now that we have the patient flow working the way we want, take a look at displaying data collected by this model: Open the Patient Flow process flow. From the Library under the Basic group, drag a Milestone activity into the process flow and insert it before the Split activity in the Consult container. Rename this activity End Treatment. Open its properties and in the Milestone Name box enter EndTreatment . On the main toolbar, click the Dashboards button to open a menu. Select Add a Dashboard to create a new dashboard. From the Library under the People Templates group, drag a Avg Milestone Times chart into the dashboard. In its properties window move to the Partitions/Sorting tab. Add a Patient Label partition by clicking the plus button. Choose Treatment in the dropdown that was added. Click the OK button to apply the settings. From the Library under the Staff State Templates group, drag a (pie chart) Avg State chart into the dashboard. In its properties window move to the Options tab. In the Groups to compare list box check the RNs , MDs , and Techs boxes. Click the OK button to apply the settings. Save your model. Reset and run the simulation model. The charts should display data similar to this: Conclusion Up to this point, the patients and staff members sometimes walk through walls and objects. In the next tutorial task, you'll learn how to fix this problem using A* navigation. Continue on to Tutorial Task 1.4 - Add A* Navigation ."
    },
    {
        "url": "https://docs.flexsim.com/en/25.2/Tutorials/FlexSimHC/1-4AddAStarNavigation/1-4AddAStarNavigation.html",
        "title": "Tutorial Task 1.4 - Add A* Navigation",
        "content": "Task Overview In this tutorial task, you'll learn how to use A* navigation to prevent the patients and staff members from walking through objects and the floor plan walls. With A* navigation, you can designate where the patients and staff members can walk and where they cannot. When you're finished, your simulation model should look similar to the following image: Step 1 Add A* Dividers In this step, you'll add some A* dividers to the model. A* navigation is a tool that calculates the shortest path a person can use when walking from one object to another. You can place dividers to prevent a person from walking through an area that they shouldn't walk through (such as walking through an object or the wall of a room). The A* Navigator will take these dividers into account when calculating the best path for a person to travel. See Working With A* Navigation for more information. When you're finished adding the dividers, the model will look similar to the following image: To add A* dividers: Make sure the 3D model is open and active. In the Library under the A* Navigation group, drag a Grid object into the model. Click the A* Grid (the large blue bar that surrounds the A* dividers) to select it. In Properties in the Node Spacing X and Node Spacing Y boxes, delete the current number and type 0.50 instead. Notice that the dividers and grid lines will become smaller. Use the red sizer arrows to resize the grid around the floorplan. Make sure the 3D model is open and active. In the Library under the A* Navigation group, click a Divider object to enter Create Dividers mode. Your mouse pointer will change to the Dividers icon to show that you are in Create Dividers mode. Find the position in your simulation model where you want to place the beginning corner of a divider. When you click that position in the model and start moving the mouse pointer in a different direction, you'll notice that it begins creating a divider. Reposition the mouse pointer until the divider's end is at the approximate length, angle, and radius you want it to be relative to the start. Click the mouse again to finish creating the divider. Press Esc to exit Create Divider mode. Right-Click to Stay in Create Dividers Mode After you're done drawing a divider or a continuous set of dividers, you can right-click to close off a divider but still remain in Create Dividers mode. You can use this method to create multiple dividers that aren't connected to each other. These dividers will act as walls in the simulation model. Start by creating the outer walls on the floor plan (the ones surrounding the whole building). If you need to move or resize a divider, click the end points and drag them to a different position. Notice that when you added the dividers, an A* Navigator tool was automatically added to the Toolbox . Before adding dividers to the interior walls of the floor plan, double-click the A* Navigator tool in the Toolbox to open its properties window. On the Visual tab, check the Show Grid Nodes checkbox. Click the OK button to save changes and close the window. Add more dividers for the interior walls of the building. Don't worry about putting the dividers exactly over the floor plan's walls. It's more important to try to put dividers in between the yellow A* grid lines if possible. These dividers will prevent movement from one point on the grid to another so it will work better if placed in between the grid rather than over it. Snap Dividers to Grid The A* Navigator has a check box called Snap Dividers to Grid which is checked by default. This means that the dividers will always be locked to correct positions. Now that you've added dividers, you don't need the yellow gridlines any more. Double-click the A* Navigator in the Toolbox to open its properties window. On the Visual tab, uncheck the Show Grid Nodes checkbox. Click the OK button to save changes and close the window. Now that you've added A* dividers, it's time to add the 3D objects in the model to the A* navigation system. You'll add the objects in the next step. Step 2 Connect 3D Objects to the A* Navigator In this step, you'll connect most of the model's objects to the A* Navigator. By connecting location and prop objects to the A* system, it creates a small area of space around the objects that staff and patients will not be able to walk through. Connecting staff members to the A* system tells them to use A* for navigating around the model. You'll also learn how to check 3D object's travel thresholds in order to prevent any strange behavior when the 3D objects are using the A* navigation system. To connect the 3D objects to the A* Navigator: Press and hold the A key to enter connection mode. When you are in connection mode, your mouse pointer will change to a plus sign with a chain link symbol next to it: Once you are in connection mode, click on either a Barrier, Divider, A* Grid, Bridge, or Path . Click Nurse Station B1 to connect the object to the A* Network. These next steps will demonstrate another method for adding members to the A* navigation system. Double-click the A* Navigator in the Toolbox to open its properties window. On the Setup tab in the Members group, make sure that All Members is selected as the current member view. Click the Add button to open a menu of all the objects in the model organized by their type. Click the Locations , Multilocations , and Staff categories. Then click the Select button. Notice that all the objects of those types now appear in the members list. Step 3 Adjust for Travel Threshold In this step, you'll display the travel threshold for several object in the model and adjust their position accordingly. The Show Travel Threshold checkbox that we use in this step is a visual display of the logic that A* uses under the hood. What is the Travel Threshold? The A* Navigation system uses the travel threshold to calculate the shortest possible point between two objects. An object's travel threshold represents the possible entry points that a person may travel to when they are walking to that object. When a traveler is given instructions to travel to an object, the A* Navigator will compute the shortest path between the traveler and any of the red dots. The traveler will then begin traveling following this shortest path. As soon as the traveler reaches any of the blue dots, FlexSim will consider the traveler as having arrived and the travel task as complete. Why does this matter in this tutorial? If the red dots of the object's travel threshold are on the wrong side of a barrier, that can potentially cause travelers to approach the object through a barriers, which would mess up the calculation. For example, if the back of a chair is up against a wall, the red portion of its travel threshold might actually extend beyond that walls of the room it is in. This might cause the person to walk to the area on the outside the room on the other side of the wall to get to the chair. This travel path would look strange and illogical. The way to fix this is to make sure the chair's travel threshold doesn't extend beyond a wall. To show object travel thresholds and adjust for them: Double-click the A* Navigator in the Toolbox to open its properties window. On the Visual tab, check the Show Travel Threshold checkbox. Click the OK button to save changes and close the window. Click the ExamTable1 object to select it. Notice that you can now see the object's travel threshold, represented by several red and blue dots surrounding the object. Check to ensure that the none of the red travel threshold dots go beyond the dividers. (It is fine if the blue dots extend beyond the dividers.) For example, the following image shows a chair's red travel threshold that extends past a divider: Drag the ExamTable so that it is a little further away from the divider and none of the red travel thresholds extend beyond the divider. Be aware that there will also not be any problems if the red travel thresholds are exactly inside a divider. Repeat the previous steps with all of the Exam Tables to ensure their red travel threshold dots do not extend beyond each room's walls. If you would like to turn off the visual guides for the A* Navigation system, double-click the A* Navigator in the Toolbox to open its properties window. On the Visual tab, clear all the checkboxes. Save, then reset and run the simulation model: Now when you run the model, the patients and the RNs no longer walk through objects or walls. Notice that the RN walks around the desks and the walls in the floor plan while traveling to the patient vitals area with the patient. Adding Preferred Paths If you dislike staff and patients hugging the walls a little bit when walking through halls, experiment with the Preferred Path library object by adding a section of preferred path down the center of the hallway. See Adding Preferred Paths for more information. Conclusion Up to this point, you've created a simulation model of a health care clinic in which a patient completes all the steps in their flow. In the next tutorial task, we'll look at how to give staff tasks independent of a patient's flow. Continue on to Tutorial Task 1.5 - Create Independent Tasks ."
    },
    {
        "url": "https://docs.flexsim.com/en/25.2/Tutorials/FlexSimHC/1-5CreateIndependentTasks/1-5CreateIndependentTasks.html",
        "title": "Tutorial Task 1.5 - Create Independent Staff Tasks",
        "content": "Task Overview Up to this point in the tutorial, you've learned how to create tasks that are patient-centered , meaning tasks that are tied to a patient entering the health care system and working through the patient track from beginning to end. In this tutorial task, you'll learn how to create independent staff tasks , which are tasks that are not tied to a specific patient that is currently in the system. Staff members work on these kinds of tasks independently of patients. In this tutorial task, you'll learn how to add a maintenance task to a location after it has been used and you'll learn how to create routine tasks that might temporarily take a staff member away from caring for a patient. Then, you'll learn how to create a shift schedule for staff members that will determine when they are available to work (as opposed to being off work or on a break). Step 1 Create a Location Maintenance Task Usually after a patient leaves an examination room, a nurse needs to lightly clean and prepare the room for the next patient. You can add those types of cleaning tasks by adding maintenance tasks to a location. This step will show you how to edit the properties for the exam tables to add a maintenance task. This task will be assigned to one of the nurses after a patient leaves the exam table. The amount of time it takes to complete the maintenance task will represent the amount of time it takes to clean and prepare the exam room for the next patient. After the maintenance task is complete, the exam room can be acquired by another patient. To add maintenance tasks to the exam tables: Make sure the 3D model is open and active and that you are in FlexSim Healthcare mode. In the 3D model, press the Ctrl button and click once on each ExamTable objects. A red box will appear around the ExamTables to show they are selected. Click Exam Table 1 to select it. In Properties (the panel on the far right), look for the Process Flow Variables group. In the Maintenance Condition box, type 1.00 . What Does This Code Mean? The Maintenance Condition property is checking whether maintenance is needed on this location after a patient is through using it. If the condition is set to 0.00 , this property will interpret that as \"false\" and maintenance will not be required. By changing it to 1.00 , the property will interpret that as \"true\" and maintenance will be required after a patient leaves the location. Be aware that you could also assign a statistical distribution so that the location returns either a true or a false value at random or a certain percentage of time. In the Maintenance Time box, delete the current number and type minutes(5) . Click the arrow next to the Maintenance Staff box to open a menu. Point to Group , then select RNs . Remember to press and hold down the Shift key while clicking a blank area in the 3D model with your mouse to de-select everything. Save, then reset and run the simulation model: Notice that after a nurse escorts a patient to the exit, the nurse then returns to the exam room that the patient just left. The nurse remains in the exam room for a certain period of time, representing the amount of time it takes to perform the necessary maintenance tasks to prepare the exam room for the next patient. Step 2 Add a Phone Call Process Flow In this step, you'll learn how to create a system for staff members to receive and answer phone calls. To create this system, you'll need to add a phone to the 3D model. Then you'll create a new process flow that will create phone calls and assign those phone call tasks to the clerk at the registration desk. When you're finished, your process flow should look similar to the following image: For now, you'll merely add and connect these activities to the process flow. You'll edit the properties to add logic in a later step. To add a phone and create a new phone call process flow: Make sure the 3D model is open and active and that you are in the FlexSim Healthcare environment. In the Library under the Healthcare group, click the Location object to open a menu of location objects. Drag a Phone object into the model and place it near Nurse Station B1 . Change the phone's Z-rotation to 90 . Move Phone1 so that it is on the Nurse Station B1 desk. On the main toolbar, click the Process Flows button to open a menu. Select Add a General Process Flow . In Properties, rename this process flow Phone Calls . From the Library under the HC Activity Sets group, drag a Process with Staff activity set into the process flow. Rename this shape container Phone Calls . Rename the Staff resource Clerk . From the Library under the Token Creation group, drag an Inter-Arrival Source activity into the process flow, adding it to the beginning of the activity set. From the Library under the Basic group, drag a Sink activity into the process flow, adding it to the end of the activity set. Check to ensure that your process flow looks similar to the image at the beginning of this step. Step 3 Edit the Phone Call Process Flow In this step, you'll add the logic for the process flow you created in the previous step. You'll create the logic that will randomly generate phone calls and then instruct the clerk to answer those calls. To build this logic: In the Phone Calls shape container, click the icon of the Clerk resource to open its properties. Click the arrow next to the Staff box to open a menu. Select Staff by List of Choices . Click the plus button so you now have three rows. Click the arrow next to the first row, point to Staff Groups and then select RNs . Select Techs for the second row and MDs for the third. Click the icon of the Source activity to open its properties. Next to the Inter-Arrivaltime box, click the Edit Properties button to open the properties for this statistical distribution. In the Scale box, delete the current number and type minutes(5) . Click the Acquire Clerk activity to select it. In Properties, click the Advanced button to expand the properties. In the Puller box, delete the current text and type token instead. Why Do We Need to Change the Puller? By default, tokens in FlexSim Healthcare activity sets are associated with a specific patient. These phone calls will not be associated with a specific patient in the 3D model. Because the tasks associated with this token will be independent of a patient, you'll simply associate it with the token itself. Open the properties of the Walk activity. Next to the Destination box, click the Sampler button and sample Phone1 . Open the properties of the Process activity. In the Process Time box, delete the text and type minutes(1) . Press the Advanced button to show the Involved Resources options. Press the topmost red X button to delete the first involved resource. (To the right of the Object box that says token.Patient ) Press the arrow next to the State box. Point to Staff and then select PerformingTask . Step 4 Change the Priority Level of Phone Calls In this tutorial step, you'll learn more about the priority and preemption system in FlexSim Healthcare. Using this system, you have the ability to add different priority levels to staff, location, equipment, and transport resources in a patient flow. Priority levels help you to determine the best way to allocate resources when there may be a limited supply. See HC Staff and Resource Priorities for a more in-depth explanation of the priority and preemption system. In this example, you'll learn how to make staff prioritize answering phone calls before doing other tasks. You'll do this by changing the priority level of the staff resource that is associated with answering phone calls: Make sure the Phone Calls process flow is open and active. Click the Clerk staff resource to open its properties. In the Priority box, delete the current number and type 200.00 instead. Save, then reset and run the simulation model. As you watch, notice that when a token is created in the Phone Calls flow an RN or other available staff is diverted to answer the phone. The Value of Simulation One possible way you could get useful data from your simulation model would be to determine if the phone calls cause a delay or bottlenecks that slow the rest of the system down. Running the model over long periods of time could help give that kind of data. Step 5 Add Members to a Shift Schedule In this step, you'll learn how to use the Time Table tool to create a shift schedule for your staff members. The shift schedule will determine when staff members are off schedule, on break, or when they are available to work on tasks. In this first step, you'll learn how to create a time table and add staff members to the time table. To create a time table: Open the Toolbox in the left pane. Click the Add button to open a menu. Select Time Table . In the Time Table properties window, change the name of the time table to ShiftSchedules . On the Members tab, click the Sampler button to enter sampling mode. Click MD1 to sample it. Repeat the previous steps to add all of the staff members to the time table. Leave the Time Table properties window open and continue to the next step. Step 6 Add Off Hours and Breaks to a Schedule In this step, you'll continue working on the time table that you created in the previous step. You'll learn how to set the schedule's hours for times when the staff members are off schedule and when they are on break. You'll also learn how to set a schedule so that it repeats over a week. In the Table tab, click the Mode menu and select Weekly Repeat . You Can Expand the Properties Window It might be helpful when working with a time table to expand the window and make it easier to view. To expand the window, place the cursor over the right border of the window and drag it to the ideal size as needed. Click the Snap To menu to open another menu and select 30 min . Click inside the Monday row near the 0:00 time slot and drag the cursor to the right to draw a box. Release the cursor at the 8:30 time slot. If needed, you can resize the box using the sizer handles at either end of the box. Click the Down Behavior menu and select OffSchedule . The box you drew in the previous step will turn red. With the new box selected, check the Repeating Event box. Click the first box and press Ctrl+C to copy all the boxes. Move your cursor closer to the right on the Monday row and press Ctrl+V to paste the box. Resize the copied box so that it covers 17:30 to 24:00 . Click inside the Monday row near the 12:00 time slot and drag the cursor to the right, releasing it at 13:00 . Click the Down Behavior menu and select Lunch . With the new box selected, check the Repeating Event box. Click the Snap To menu to open another menu and select 15 min . Click inside the Monday row near the 15:00 time slot and drag the cursor to the right, releasing it at 15:15 . Click the Down Behavior menu and select Break1 . With the new box selected, check the Repeating Event box. Press the OK button to save the changes and close the properties window. Save, then reset and run the simulation model. As you watch, notice that staff members now take breaks at their scheduled times. When on break, a box will draw under the staff with the color reflecting the color of the Down Behavior associated with that break. You could also use this same method to build different schedules for staff that are on a morning shift or an evening shift or scheduling events such as staff meetings. Conclusion At this point, the model is practically done. You can stop here or if you'd like to learn one more useful trick continue on to the last task where you'll learn how to make a custom location object Tutorial Task 1.6 - Add Custom Location ."
    },
    {
        "url": "https://docs.flexsim.com/en/25.2/Tutorials/FlexSimHC/1-6AddCustomLocation/1-6AddCustomLocation.html",
        "title": "Tutorial Task 1.6 - Add a Custom Location Object",
        "content": "Task Overview In this tutorial task, you'll learn how to add a custom location object by creating a meeting place where two staff members can consult with each other. Step 1 Add a Custom Location Object In this step, you'll create a custom location object: a meeting place where two staff members can consult with each other. Visually, it will look like a circle on the floor: To add this custom location object: Make sure the 3D model is currently the active window and that you are in the FlexSim Healthcare environment. In the left pane, click the Library tab to open the Library. In the Library under the Healthcare group, click the Prop object to open a menu of location objects. Drag a Cylinder object (under Basic Shapes ) into the model. (Use the image in the introduction for this step as a guide for placing objects in the model.) Click Cylinder1 to bring up its properties on the Right. In the box at the top of the window, rename the cylinder MeetingPlace . Under the Visuals section, change the Size properties as follows: X-Size : 2.00 Y-Size : 2.00 Z-Size : 0.01 In the next step, you'll learn how to add enter instructions for the custom object you just added to the model. Step 2 Create Enter Instructions When you're working with custom location objects, you need to assign the object's enter and/or exit instructions. These instructions tell the object which animations it should apply when it is interacting with patients and staff. You can assign different instructions to different types of FlexSim Healthcare objects if needed. For the meeting place object, you'll create two sets of instructions: one for the first staff member that enters the object and one for the second staff member. You'll create enter instructions that will tell each staff member where to stand and will animate them talking to each other. This animation will loop continuously until the staff members leave the object. The meeting place object won't need any exit instructions, so you won't add any at this time. To create the enter instructions for this custom location object: Ensure that the MeetingPlace object is still highlighted. In Properties, under the Enter/Exit Instruction Instructions section, click the Edit Enter Instruction button to bring up the Enter Instructions window. Confirm that the Template menu is set to Custom . In the Role list on the left, click the Add button to add a new role to the list. In the Name box, delete the text and type Staff . Click the arrow next to the Condition box to open a menu and select Is an Operator . Back by the Role list on the left, click the arrow next to the Add button to open a menu. Select Add Sub Role . In the Name box, delete the text and type First . Click the arrow next to the Condition box to open a menu and select First to Arrive . Click the Apply button to save these changes. Next to the Instructions box, click the Add button to open a menu. Select Walk to Location to add this instruction. Repeat the previous step to add two more instructions: A Set Rotation instruction A Play Animation instruction Click the arrow next to the Play Animation instruction box to open a menu. Point to Person Animations , then select Stand . At the top of all the instructions, check the Planner Person checkbox. You'll see a person appear on the MeetingPlace shape in the 3D model. Reposition the Planner Person so that it is on one side of the MeetingPlace shape. Click the Apply Planner Position button next to the Walk to Position instructions to change the offsets. In the Role list, confirm that the First role still selected. Then click the Duplicate button to make a copy of this role. In the Name box, delete the text and type Second . In the Condition box, type roleRank == 2 . What Does This Code Mean? This code will evaluate whether the staff member is the first or second person to arrive at the MeetingPlace object. If the staff member is the second to arrive, it will apply these entrance instructions to that person. Click the Apply button to save these changes. Click the arrow next to the Play Animation instruction box to open a menu. Point to Person Animations , then select Shrug . Reposition the Planner Person so that it is on the opposite side of the MeetingPlace shape. Click the Apply Planner Position button next to the Walk to Position instructions to change the offsets. In the Set Rotation instructions, change the Z to -180.00 . Alternative Rotation Method You could also change the rotation of the planner person using the blue sizer arrow in the 3D model and click the Apply Planner Position button to change the rotation settings. Clear the Planner Person checkbox. Press the OK button to save the changes and close the properties window. You can test your custom object by pointing the Office variable in the Consult container of the Patient Flow at this new object. Conclusion This concludes the FlexSim Healthcare Tutorial. By now you should have a good sense of all the different tools that are available to you when building a FlexSim Healthcare model. Be aware that in a normal simulation project, you'd go on to make sure your data inputs were correct by studying the times that it takes to complete registration, examinations, and other treatment times."
    }
]